Revit 2024 API
Polyloop.ComputeArea Method
 Gets the area for this polygon.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double ComputeArea()
Visual Basic
Public Function ComputeArea As Double
Visual C++
public:
double ComputeArea()
Return Value
 The area for this polygon.
Remarks
 The area of the planar non-self-intersecting polygon computed as: A = 1/2 * (X1 Y2) - (X2 Y1) + ... + (Xn Y1) - (X1 Yn)
See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace